In [46]:
import pandas as pd
# Load the database from the csv file
df = pd.read_csv(r"../database.csv", na_filter=False)
df.head()

   id     name   dataType status
0  R0     zmze       user
1  R1      tca       user
2  R2  TEK3000  equipment     R0
3  R3   DS6000  equipment

In [47]:
df[df.name == "zmze"]

   id  name dataType status
0  R0  zmze     user

In [49]:
df[df["id"] == "R2"].index.values[0]

2

In [50]:
df2 = df.copy()
df3 = df.copy()[["id", "name"]]

df3.rename({"id" : "status"}, inplace=True, axis=1)

In [51]:
df2

   id     name   dataType status
0  R0     zmze       user
1  R1      tca       user
2  R2  TEK3000  equipment     R0
3  R3   DS6000  equipment

In [52]:
df3

  status     name
0     R0     zmze
1     R1      tca
2     R2  TEK3000
3     R3   DS6000

In [58]:

df2.join(df3.set_index('status'), on="status", rsuffix="_user", how="left", )

   id     name   dataType status name_user
0  R0     zmze       user              NaN
1  R1      tca       user              NaN
2  R2  TEK3000  equipment     R0      zmze
3  R3   DS6000  equipment              NaN